import os

# Конфигурация бота

# Читаем токен из переменных окружения Render
BOT_TOKEN = os.environ.get("BOT_TOKEN", "")

# Ключевые слова для поиска тендеров
KEYWORDS = [
    "трансформатор",
    "КТПС",
    "ГКТП",
    "ТРАНСФОРМАТОРНАЯ ПОДСТАНЦИЯ",
    "КРУН",
    "ОРУ-35 КВ",
    "РП",
    "ЭЛЕКТРОМОНТАЖ",
    "КОМПЛЕКТНАЯ ПОДСТАНЦИЯ"
]

# Фильтр по сумме (в сумах)
MIN_AMOUNT = 1_000_000
MAX_AMOUNT = 5_000_000_000

CHECK_INTERVAL = 30

# Читаем Chat ID из переменных окружения Render
YOUR_CHAT_ID = int(os.environ.get("YOUR_CHAT_ID", "0"))
